Revit 2024 API
ClosestPointsPairBetweenTwoCurves.ParameterOnFirstCurve Property
 1d raw (not normalized) parameter of the point on the first curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public double ParameterOnFirstCurve { get; set; }
Visual Basic
Public Property ParameterOnFirstCurve As Double
	Get
	Set
Visual C++
public:
property double ParameterOnFirstCurve {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The property has not been set by the method providing the result.
See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace